app/controllers/songs_controller.rb

  def index
    @songs = Song.all
   if params[:artist_id]
     @artist = Artist.find_by(id: params[:artist_id])
---
SELECT "songs".* FROM "songs"
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]